[
  {
    "id": "cslit",
    "title": "CS-LIT",
    "featured": true,
    "image": "/cslit-logo.svg",
    "screenshots": {
      "mobile": [
        "/screenshots/cslit-screenshot-1"
      ],
      "desktop": [
        "/screenshots/cslit-screenshot-2",
        "/screenshots/cslit-screenshot-3"
      ]
    },
    "tags": [
      {
        "frontend": [
          "nextjs",
          "redux",
          "typescript",
          "tailwind",
          "react"
        ],
        "backend": [
          "trpc",
          "prisma",
          "postgresql"
        ],
        "devops": [
          "vercel",
          "vitest",
          "cypress",
          "reacttestinglibrary",
          "docker",
          "githubactions",
          "cicd"
        ],
        "libs": [
          "reactspring",
          "reactquery",
          "authjs",
          "zod",
          "html2canvas"
        ]
      }
    ],
    "tagsShort": [
      "nextjs",
      "trpc",
      "prisma"
    ],
    "description": [
      "CS-LIT, short for \"Computer Science Like I'm Ten,\" is a comprehensive web platform designed to simplify complex computer science subjects through user-generated analogies.",
      "This fully functional product enables users to sign up, contribute, and explore analogies for challenging CS topics. As the sole developer, I built CS-LIT from the ground up, embracing the project as both a learning experience and a personal challenge.",
      "The platform serves as a collaborative space where individuals can share their unique perspectives, making computer science more accessible and enjoyable for learners of all levels."
    ],
    "descriptionShort": "This is a short description.",
    "features": [
      "User Registration, Login, and Analogy Sharing.",
      "Login Options: Social login providers, email magic link.",
      "Dedicated Auth pages for login and registration.",
      "Fully typesafe architecture (back to front) using tRPC for API.",
      "Redux state manager chosen for handling growing complexities in states.",
      "Opportunity to learn Redux during project development.",
      "Unit tests via Vitest and End-to-end (e2e) tests using Cypress.",
      "Docker implementation for flexible deployment.",
      "Handled Error boundaries with dedicated error pages.",
      "Descriptive error messages for better user experience.",
      "Zod used for robust data validation.",
      "Responsive design for optimal user experience.",
      "Clean code and organized folder structure.",
      "Share analogies via link or convert DOM into an image using html2canvas.",
      "Commenting system for user interaction.",
      "Voting and validation system for analogies.",
      "Code pasting with syntax highlighting support.",
      "Markdown support for enhanced content formatting.",
      "Search system with debounce for finding topics.",
      "Infinite scroll using React Query for every list of data.",
      "Full admin panel for publishing, editing, or deleting entities.",
      "Utilized React Query for stale-while-revalidate fetching and implemented skeleton loadings for better UX."
    ],
    "githubLink": "https://github.com/b-amir/cs-lit",
    "demoLink": "https://cslit.cc",
    "producHuntLink": "https://www.producthunt.com/posts/cs-lit"
  },
  {
    "id": "thiscovered",
    "title": "this.covered",
    "image": "/thiscovered-logo.svg",
    "screenshots": {
      "mobile": [
        "/screenshots/thiscovered-screenshot-1"
      ],
      "desktop": [
        "/screenshots/thiscovered-screenshot-2"
      ]
    },
    "tags": [
      {
        "frontend": [
          "react",
          "api",
          "typescript",
          "reactrouter",
          "css"
        ],
        "backend": [],
        "devops": [
          "githubactions",
          "githubpages",
          "cicd"
        ],
        "libs": [
          "vite",
          "html2canvas"
        ]
      }
    ],
    "tagsShort": [
      "react",
      "api",
      "reactrouter"
    ],
    "description": [
      "Introducing \"this.covered\" — a playful and client-side website crafted to empower individuals in enhancing their LinkedIn profiles with eye-catching header images. ",
      " With the tagline \"Wanna get discovered? You got this.covered!\", the platform aims to elevate personal branding by offering a simple and enjoyable image creation experience. Utilizing the Unsplash API, users can easily find and customize header images that resonate with their professional identity. Elevate your online presence with \"this.covered\" and make a lasting impression. ",
      "I hope you find all the easter eggs I put in this project :)"
    ],
    "descriptionShort": "This is a short description of the second project.",
    "features": [
      "Client-Side Project via Vite.",
      "Used Unsplash public and private API to find images.",
      "Add a small box of personal information to your cover photo.",
      "Save your custom cover photo to your device.",
      "Follow a list of tips and tricks to create a more complete LinkedIn profile.",
      "Typesafe via TypeScript.",
      "Responsive Design and Mobile-Friendly: Implemented swiping for mobile.",
      "Implemented Dark Theme.",
      "Deployed on Github Pages."
    ],
    "githubLink": "https://github.com/b-amir/thiscovered",
    "demoLink": "https://b-amir.github.io/thiscovered/"
  },
  {
    "id": "portfolio",
    "title": "this website!",
    "image": "/thing.svg",
    "screenshots": [],
    "tags": [
      {
        "frontend": [
          "nextjs",
          "sass",
          "typescript",
          "react"
        ],
        "backend": [],
        "devops": [
          "cicd",
          "vercel"
        ],
        "libs": [
          "spline"
        ]
      }
    ],
    "tagsShort": [
      "nextjs",
      "sass",
      "spline"
    ],
    "description": [
      "I wanted my portfolio website to be more than just a showcase—it became a journey of exploration and learning.",
      " In this project, I decided to dip my toes into Sass for a cleaner style and ventured into 3D design using Spline,    inspired by my past experiences with 3D software in school.",
      " The goal was to embrace the opportunity to try new things. Sass added a bit of structure to the styling, and the subtle 3D touch reflects my curiosity. My portfolio is a simple testament to learning and experimenting in a space that's as much about discovery as it is about showcasing work"
    ],
    "descriptionShort": "Short description for the third project.",
    "features": [
      "Opportunity to Learn Sass for Styling.",
      "Utilized Spline, which uses Three.js, for 3D and interactive objects on the web.",
      "Minimal usage of 3d objects with Performance Measures for Low-Tier Devices.",
      "Responsive Design.",
      "Typesafe via TypeScript.",
      "Filter Projects via Skill Tags.",
      "Implemented Project Routes via Next.js App Router."
    ],
    "githubLink": "https://github.com/b-amir/my-portfolio",
    "demoLink": "https://b-amir.link"
  },
  {
    "id": "futpal",
    "title": "Futpal",
    "image": "/futpal-logo.svg",
    "screenshots": {
      "mobile": [
        "/screenshots/futpal-screenshot-1",
        "/screenshots/futpal-screenshot-2"
      ],
      "desktop": [
        "/screenshots/futpal-screenshot-3",
        "/screenshots/futpal-screenshot-4"
      ]
    },
    "tags": [
      {
        "frontend": [
          "react",
          "pwa",
          "api",
          "css",
          "typescript"
        ],
        "backend": [],
        "devops": [],
        "libs": [
          "reactrouter"
        ]
      }
    ],
    "tagsShort": [
      "react",
      "api",
      "css"
    ],
    "description": [
      "Futpal is a web application tailored for Fantasy Premier League (FPL) enthusiasts, designed to provide a toolkit for FPL managers seeking to elevate their game.",
      "With live Premier League game results sourced from a third-party API, users can stay on top of the action in real time. The application goes beyond the surface, offering granular in-game fantasy statistics and numbers retrieved from the unofficial FPL API, by overcoming the classic CORS problem. ",
      "Futpal aims to empower FPL managers with the insights and tools they need to make strategic decisions and stay ahead in the fantasy football realm."
    ],
    "descriptionShort": "Short description for the fourth project.",
    "features": [
      "Tailored for Fantasy Premier League (FPL) enthusiasts.",
      "Live Premier League game results from a third-party API for real-time updates.",
      "Granular in-game fantasy statistics and numbers retrieved from the unofficial FPL API.",
      "Overcame CORS problem for comprehensive data access.",
      "In-App Currency system for user transactions.",
      "Empowers FPL managers with insights and tools for strategic decision-making.",
      "Opportunity to learn about PWA (Progressive Web App).",
      "Utilized react useContext for state management.",
      "Responsive Design.",
      "Typesafe via TypeScript."
    ],
    "githubLink": "",
    "demoLink": ""
  },
  {
    "id": "adeptivity",
    "title": "Adeptivity",
    "image": "/adeptivity-logo.svg",
    "screenshots": {
      "mobile": [],
      "desktop": [
        "/screenshots/adeptivity-screenshot-1"
      ]
    },
    "tags": [
      {
        "frontend": [
          "nextjs",
          "themeui",
          "react",
          "javascript"
        ],
        "backend": [
          "postgresql"
        ],
        "devops": [
          "githubactions",
          "netlify",
          "cicd"
        ],
        "libs": [
          "strapi"
        ]
      }
    ],
    "tagsShort": [
      "nextjs",
      "strapi",
      "themeui"
    ],
    "description": [
      "Adeptivity marks the online presence of a real startup, offering a landing page and a dynamic blog section. The landing page, crafted with Next.js, serves as a captivating introduction to the startup's offerings and ethos.",
      "For the blog, I implemented a combination of Next.js and Strapi, leveraging the ease of Strapi as a content management system. ",
      "This setup not only ensures a seamless and responsive landing page experience but also provides the startup with a user-friendly platform to share insights and updates through an efficiently managed blog."
    ],
    "descriptionShort": "Short description for the fifth project.",
    "features": [
      "Online presence for a real startup.",
      "Landing page crafted with Next.js for a captivating introduction to offerings and ethos.",
      "Dynamic blog section implemented with Next.js and Strapi.",
      "Leveraged Strapi as a user-friendly content management system.",
      "Seamless and responsive landing page experience.",
      "Efficiently managed blog for sharing insights and updates.",
      "Responsive Design.",
      "Used Theme-UI for a unified design."
    ],
    "githubLink": "",
    "demoLink": "https://adeptivity.co"
  },
  {
    "id": "notopia",
    "title": "Notopia",
    "image": "/notopia-logo.svg",
    "screenshots": {
      "mobile": [],
      "desktop": [
        "/screenshots/notopia-screenshot-1"
      ]
    },
    "tags": [
      {
        "frontend": [
          "react",
          "css",
          "javascript"
        ],
        "backend": [],
        "devops": [],
        "libs": [
          "electron",
          "editorjs"
        ]
      }
    ],
    "tagsShort": [
      "react",
      "electron",
      "css"
    ],
    "description": [
      "Notopia is my take on a note-taking app (since every developer has one), both for the web and desktop.",
      "It features a block-style text editor (a simple Notion clone, if you will), relying on EditorJS library.",
      "On the desktop, I used Electron, keeping things simple and using as few third-party libraries as possible."
    ],
    "descriptionShort": "Short description for the sixth project.",
    "features": [
      "Note-taking app for web and desktop – Notopia.",
      "Block-style text editor reminiscent of a Notion clone.",
      "Used local storage + custom hooks for data persistence.",
      "Desktop version built with Electron, focusing on simplicity.",
      "Minimal reliance on third-party libraries, with only EditorJS for editing.",
      "Customized EditorJS's design to seamlessly fit into the project.",
      "Straightforward and practical tool for efficient note-taking.",
      "Implemented masonry layout without any third-party libraries."
    ],
    "githubLink": "",
    "demoLink": ""
  }
]