[
  {
    "id": "cslit",
    "title": "CS-LIT",
    "image": "/cslit-logo.svg",
    "tags": [
      {
        "frontend": [
          "nextjs",
          "redux",
          "typescript",
          "tailwind"
        ],
        "Backend, API, DB": [
          "trpc",
          "prisma",
          "postgresql"
        ],
        "DevOps, Testing": [
          "vercel",
          "vitest",
          "cypress",
          "reacttestinglibrary",
          "docker",
          "githubactions"
        ],
        "Libs, etc": [
          "reactspring",
          "reactquery",
          "authjs",
          "zod"
        ]
      }
    ],
    "tagsShort": [
      "nextjs",
      "trpc",
      "prisma"
    ],
    "description": "<div>CS-LIT, short for \"Computer Science Like I'm Ten,\" is a comprehensive web platform designed to simplify complex computer science subjects through user-generated analogies.<br/>This fully functional product enables users to sign up, contribute, and explore analogies for challenging CS topics. As the sole developer, I built CS-LIT from the ground up, embracing the project as both a learning experience and a personal challenge.<br/>The platform serves as a collaborative space where individuals can share their unique perspectives, making computer science more accessible and enjoyable for learners of all levels.</div>",
    "descriptionShort": "This is a short description.",
    "githubLink": "https://github.com/user/project",
    "demoLink": "https://demo.com/project"
  },
  {
    "id": "thiscovered",
    "title": "this.covered",
    "image": "/thiscovered-logo.svg",
    "tags": [
      {
        "frontend": [
          "react",
          "api",
          "typescript",
          "reactrouter",
          "css"
        ],
        "Backend, API, DB": [],
        "DevOps, Testing": [
          "githubactions",
          "githubpages"
        ],
        "Libs, etc": [
          "vite"
        ]
      }
    ],
    "tagsShort": [
      "react",
      "api",
      "reactrouter"
    ],
    "description": "<div>Introducing \"this.covered\" — a playful and client-side website crafted to empower individuals in enhancing their LinkedIn profiles with eye-catching header images. With the tagline \"Wanna get discovered? You got this.covered!\", the platform aims to elevate personal branding by offering a simple and enjoyable image creation experience. Utilizing the Unsplash API, users can easily find and customize header images that resonate with their professional identity. Elevate your online presence with \"this.covered\" and make a lasting impression. I hope you find all the easter eggs I put in this project :)</div>",
    "descriptionShort": "This is a short description of the second project.",
    "githubLink": "https://github.com/user/project2",
    "demoLink": "https://demo.com/project2"
  },
  {
    "id": "portfolio",
    "title": "this website!",
    "image": "/thing.svg",
    "tags": [
      {
        "frontend": [
          "nextjs",
          "sass"
        ],
        "Backend, API, DB": [],
        "DevOps, Testing": [],
        "Libs, etc": [
          "spline"
        ]
      }
    ],
    "tagsShort": [
      "nextjs",
      "sass",
      "spline"
    ],
    "description": "<div>I wanted my portfolio website to be more than just a showcase—it became a journey of exploration and learning. In this project, I decided to dip my toes into Sass for a cleaner style and ventured into 3D design using Spline, inspired by my past experiences with 3D software in school. The goal was to embrace the opportunity to try new things. Sass added a bit of structure to the styling, and the subtle 3D touch reflects my curiosity. My portfolio is a simple testament to learning and experimenting in a space that's as much about discovery as it is about showcasing work.</div>",
    "descriptionShort": "Short description for the third project.",
    "githubLink": "x",
    "demoLink": "x"
  },
  {
    "id": "futpal",
    "title": "Futpal",
    "image": "/futpal-logo.svg",
    "tags": [
      {
        "frontend": [
          "react",
          "pwa",
          "api",
          "css"
        ],
        "Backend, API, DB": [],
        "DevOps, Testing": [],
        "Libs, etc": []
      }
    ],
    "tagsShort": [
      "react",
      "api",
      "css"
    ],
    "description": "<div>Futpal is a web application tailored for Fantasy Premier League (FPL) enthusiasts, designed to provide a toolkit for FPL managers seeking to elevate their game. With live Premier League game results sourced from a third-party API, users can stay on top of the action in real time. The application goes beyond the surface, offering granular in-game fantasy statistics and numbers retrieved from the unofficial FPL API, by overcoming the classic CORS problem. Futpal aims to empower FPL managers with the insights and tools they need to make strategic decisions and stay ahead in the fantasy football realm.</div>",
    "descriptionShort": "Short description for the fourth project.",
    "githubLink": "",
    "demoLink": ""
  },
  {
    "id": "adeptivity",
    "title": "Adeptivity",
    "image": "/adeptivity-logo.svg",
    "tags": [
      {
        "frontend": [
          "nextjs",
          "themeui"
        ],
        "Backend, API, DB": [
          "postgresql"
        ],
        "DevOps, Testing": [
          "githubactions",
          "netlify"
        ],
        "Libs, etc": [
          "strapi"
        ]
      }
    ],
    "tagsShort": [
      "nextjs",
      "strapi",
      "themeui"
    ],
    "description": "<div>Adeptivity marks the online presence of a real startup, offering a landing page and a dynamic blog section. The landing page, crafted with Next.js, serves as a captivating introduction to the startup's offerings and ethos. For the blog, I implemented a combination of Next.js and Strapi, leveraging the ease of Strapi as a content management system. This setup not only ensures a seamless and responsive landing page experience but also provides the startup with a user-friendly platform to share insights and updates through an efficiently managed blog.</div>",
    "descriptionShort": "Short description for the fifth project.",
    "githubLink": "",
    "demoLink": "x"
  },
  {
    "id": "notopia",
    "title": "Notopia",
    "image": "/notopia-logo.svg",
    "tags": [
      {
        "frontend": [
          "react",
          "css"
        ],
        "Backend, API, DB": [],
        "DevOps, Testing": [],
        "Libs, etc": [
          "electron",
          "editorjs"
        ]
      }
    ],
    "tagsShort": [
      "react",
      "electron",
      "css"
    ],
    "description": "<div>Notopia is my version of a note-taking app, both for the web and desktop. It features a block-style text editor, somewhat like a Notion clone. On the desktop, I used Electron, keeping things simple and using as few third-party libraries as possible—mainly relying on EditorJS for editing. It's my straightforward attempt at a practical and functional tool for note-taking.</div>",
    "descriptionShort": "Short description for the sixth project.",
    "githubLink": "",
    "demoLink": ""
  }
]